### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cf.aws_cloudfront_distribution.main will be created
+   resource "aws_cloudfront_distribution" "main" {
+       aliases                        = [
+           "example.com",
        ]
+       arn                            = (known after apply)
+       caller_reference               = (known after apply)
+       domain_name                    = (known after apply)
+       enabled                        = true
+       etag                           = (known after apply)
+       hosted_zone_id                 = (known after apply)
+       http_version                   = "http2"
+       id                             = (known after apply)
+       in_progress_validation_batches = (known after apply)
+       is_ipv6_enabled                = true
+       last_modified_time             = (known after apply)
+       price_class                    = "PriceClass_All"
+       retain_on_delete               = false
+       status                         = (known after apply)
+       tags                           = {
+           "Name" = "terraform testing"
        }
+       tags_all                       = {
+           "Name" = "terraform testing"
        }
+       trusted_key_groups             = (known after apply)
+       trusted_signers                = (known after apply)
+       wait_for_deployment            = false

+       default_cache_behavior {
+           allowed_methods        = [
+               "DELETE",
+               "GET",
+               "HEAD",
+               "OPTIONS",
+               "PATCH",
+               "POST",
+               "PUT",
            ]
+           cached_methods         = [
+               "GET",
+               "HEAD",
            ]
+           compress               = true
+           default_ttl            = 0
+           max_ttl                = 0
+           min_ttl                = 0
+           smooth_streaming       = false
+           target_origin_id       = "some-s3-bucket-name.s3.us-east-1.amazonaws.com"
+           trusted_key_groups     = (known after apply)
+           trusted_signers        = (known after apply)
+           viewer_protocol_policy = "allow-all"

+           forwarded_values {
+               headers                 = [
+                   "Origin",
                ]
+               query_string            = false
+               query_string_cache_keys = (known after apply)

+               cookies {
+                   forward           = "none"
+                   whitelisted_names = (known after apply)
                }
            }
        }

+       origin {
+           connection_attempts = 3
+           connection_timeout  = 10
+           domain_name         = "some-s3-bucket-name.s3.us-east-1.amazonaws.com"
+           origin_id           = "some-s3-bucket-name.s3.us-east-1.amazonaws.com"
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>